/*
rdm6300.h - бібліотека для роботи з радіочастотними мітками на частоті 125 кГц,
з допомогою модуля RDM 6300 (https://arduino.ua/prod259-rfid-modyl-rdm6300-125kgc)

Бібліотека дає можливість перевірити чи присутня радіочастотна мітка, 
та зчитати її ідентифікатор.
*/

// перевірка, що бібліотека ще не підключена
#ifndef rdm6300_h // якщо бібліотека ще не підключена 
#define rdm6300_h // тоді підключаємо її

#define STX 2
#define ETX 3

#include "Arduino.h"

// клас роботи з модулем RDM6300
class rdm6300 {
  public:
    rdm6300(byte pin1, byte pin2);      // конструктор
    void begin();                       // метод ініціалізації перед початком роботи
    boolean tagPresent();               // метод, що паказує чи присутня радіочастотна мітка
    byte read();                        // метод, що повертає ідентифікатор радіочастотної мітки

 private:
    int  _rx_counter;                    // рахівник, що використовується при зчитуванні даних   
    byte _rx_data[14];                   // масив, що використовується для фільтрації даних
    byte _ascii_char_to_num(byte a);     // приватний метод для перетворення символу ASCII в номер
};

#endif